/* FTP error code message */
"\n\nFTP error code: %@" = "\n\nFTP 错误代码：%@";

/* Error with FTP access to server */
"Access to the FTP server denied.  Please check your credentials." = "拒绝访问FTP服务器，请检查您的凭证。";

/* test connection failed */
"Connection Failed" = "连接失败";

/* test connection worked */
"Connection Successful" = "连接成功";

/* error message shown in properties dialog status when testing connections */
"Connection failed. Please verify your settings." = "连接失败，请验证您的设置。";

/* error message shown in properties dialog status when testing connections */
"Directory does not exist." = "目录不存在。";

/* Error with FTP server not initialized */
"Error initializing Server" = "初始化服务器时出错";

/* Inform user that there was an error with FTP and we don't know what it is */
"Error uploading with FTP" = "FTP上传时出错";

/* Error with FTP writing data */
"Error while writing data." = "写入数据时出错。";

/* plugin name */
"FTP" = "FTP";

/* General Error with FTP */
"Failed to write file. Server returned an error, which could be caused by invalid credentials or an invalid directory.  Make sure you aren't creating nested directories." = "写入文件失败。服务器返回了错误，这可能是由无效的凭证或目录造成的。 确保您未创建嵌套目录。";

/* Error with FTP password */
"Please enter a password. Go to Preferences > Share > FTP to configure." = "请输入密码。前往“首选项 > 共享 > FTP”配置。";

/* Error with FTP username */
"Please enter a username. Go to Preferences > Share > FTP to configure." = "请输入用户名。前往“首选项 > 共享 > FTP”配置。";

/* Error with FTP destination */
"Please enter a valid destination. Go to Preferences > Share > FTP to configure." = "请输入有效的目的地。前往“首选项 > 共享 > FTP”配置。";

/* plugin button tooltip */
"Send the capture to an FTP server using file transfer protocol." = "使用文件传输协议将捕获的内容发送到 FTP 服务器。";

/* Error with FTP port */
"Server port invalid. Go to Preferences > Share > FTP to configure." = "无效服务器端口。前往“首选项 > 共享 > FTP”配置。";

/* Name of the service that gets stored in the password manager */
"TechSmith FTP Output" = "TechSmith FTP 输出";

/* Error with FTP destination not reachable */
"The FTP destination could not be reached." = "无法抵达 FTP 目的地。";

/* Error with FTP write stream */
"There was an error creating the write stream." = "创建写入流时出现错误。";

/* Error with FTP reading file */
"There was an error reading the file." = "读取文件时出现错误。";

/* Inform user that upload worked */
"Upload Successful" = "上传成功";

/* Inform user that capture failed and wasn't shared */
"Your capture was not shared." = "您捕获的内容未分享。";

/* No comment provided by engineer. */
"[date]" = "[日期]";

/* No comment provided by engineer. */
"[filehash]" = "[文件哈希值]";

/* No comment provided by engineer. */
"[filename]" = "[文件名]";

